README.org
* Description

/Homebase is intended to be a lightweight dotfiles collection./

** Goals

   + Stay simple enough to be edited by the uninitiated
   + Keep dependencies to a minimum
   + Be useful
   + Stay cross-platform compatible

** Dependencies

   + Git
   + Zsh
   + Vim
   + Tmux

* Contents

** README.org - /this file/
*** Description
   Made using Emacs Org-Mode. Should be simple enough to remain readble in other text editors.
** .tmux.conf - /Tmux configuration file/
*** Description
    + Use C-e as prefix instead of C-b because it's more convenient, but avoids the Emacs conflicts of C-a or C-s.
    + Use C-e + | to open a vertical window
    + Use C-e + - to open a horizontal window 
    + Use Alt-arrow without prefix to switch panes
    + Shift-arrow to switch windows
** .vimrc - /Vim configuration file/
*** Description
    + Show line numbers
    + 256 color
    + Uses colorscheme 'openbd' which is located in '.vim/colors'
    + Highlight search results
    + Search a characters are typed
    + Syntax coloring enabled
** .zshrc - /Zsh configuration file/
*** Description
    + Loads local zsh configuration from '$HOME/.zsh/local.zsh'
    + Loads os-specific conditionals from '$HOME/.zsh/os-specific.zsh'
    + Loads settings for handling git repositories from '$HOME/.zsh/git.zsh'
    + Loads prompt settings from '$HOME/.zsh/prompt.zsh'

    Local settings are aliases or functions that really only pertain to the local system. Presently .gitignore for this repository is instructed to ignore local.zsh so that settings which may be confidential are not loaded to this repository.

    The aliases script has a lot of very useful shortcuts, but the most relevant one when editing these settings might be:

       alias rezsh='. $HOME/.zshrc'

    Which reloads the zsh configuration file after changes. 
** .vim - /Directory for addition Vim configuration files/
*** .vim/colors - /Color schemes for Vim/
** .zsh - /Directory for additional Zsh configuration files/
*** .zsh/local.zsh - /Local zsh settings/
*** .zsh/os-specific.zsh - /Operationg system conditional settings/
*** .zsh/alias.zsh - /Aliases in one seperate file for easy editing and browsing/
*** .zsh/prompt.zsh - /Setting related to the terminal prompt/
